export let config = {
    npc: {
        10000: {
            "tips": "高攻,",
            typeID: 10000,
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 57,
                "h回血速度": 14,
                "j急速": 10,
            },

            bodyType: 1,
            bulletID:0,
            skllID: [1000, 1001, 1002],
            职业: "user",
            皮肤地址: "resources/npc/ZJ-3-c.png"
        },
        10001: {
            typeID: 10001,
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 57,
                "h回血速度": 14,
                "j急速": 10,
            },
            bodyType: 1,
            bulletID: 0,
            skllID: [1003, 1004, 1005],
            职业: "user",
            皮肤地址: "resources/npc/ZJ-2-c.png"
        },
        10002: {
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 57,
                "h回血速度": 14,
                "j急速": 10,
            },
            typeID: 10002,

            bodyType: 1,
            bulletID: 0,
            skllID: [1003, 1004, 1005],
            职业: "user",
            皮肤地址: "resources/npc/ZJ-5-a.png"
        },
        10099: {
            typeID: 10099,
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 57,
                "h回血速度": 14,
                "j急速": 10,
            }, bodyType: 1, 职业: "user", 皮肤地址: "resources/prefab/npc/userBase.lh"
        },
        20000: {
            "tips": "小怪类型",
            typeID: 20000,
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 157,
                "h回血速度": 14,
                "j急速": 10,
            },
            bodyType: 1,
            moveSpeed: 10,
            bulletID: 0,
            职业: "staff",
            皮肤地址: "resources/npc/ZJ-5-a.png"
        },
        20001: {
            "tips": "Boss类型",
            typeID: 20001,
            attribute: {
                "x血量": 300,
                "x吸血": 10,
                "x血量恢复": 10,
                "n能量": 100,
                "n能量恢复": 11,
                "w物理抗性": 44,
                "m魔法抗性": 44,
                "m命中": 100,
                "s闪避": 10,
                "w物理伤害": 30,
                "m魔法伤害": 10,
                "y移动速度": 157,
                "h回血速度": 14,
                "j急速": 10,
            },
            behaviorType: 1,
            bodyType: 1,
            bulletID: 0,
            skll: [10000],
            职业: "boss",
            皮肤地址: "resources/npc/npc_02.png"
        },
    },
    bullet: {
        10000: {
            typeID: 10000, 功能类型名: "Bullet145", 发射样式: "z直线多发", 描述: "子弹说明",
            伤害系数: 1, 伤害范围: 0, 移动速度: 240, 冷却时间: 1000, 发射频率: 500, 发射次数: 2, 发射数量: 1, 皮肤地址: "resources/bullet/ZD_SanDan_1.png"
        },
        10001: {
            typeID: 10001, 功能类型名: "Bullet145", 发射样式: "s扇形多发", 描述: "子弹说明",
            伤害系数: 2, 伤害范围: 0, 移动速度: 200, 冷却时间: 550, 发射频率: 150, 发射次数: 5, 发射数量: 4, 皮肤地址: "resources/bullet/ZD_NPC_HuangQu_1.png"
        },
        10002: {
            typeID: 10002, 功能类型名: "Bullet145", 发射样式: "z直线多发", 描述: "子弹说明",
            伤害系数: 0.7, 伤害范围: 0, 移动速度: 350, 冷却时间: 1500, 发射频率: 300, 发射次数: 1, 发射数量: 1, 皮肤地址: "resources/bullet/ZD_a_1.png"
        },
        10003: {
            typeID: 10003, 功能类型名: "Bullet145", 发射样式: "z直线多发", 描述: "炮弹",
            伤害系数: 2, 伤害范围: 100, 移动速度: 300, 冷却时间: 2000, 发射频率: 150, 发射次数: 1, 发射数量: 1, 皮肤地址: "resources/bullet/ZD_d_1.png"
        },
        10004: {
            typeID: 10004, 功能类型名: "Bullet145", 发射样式: "x旋转发射", 描述: "360方向的子弹",
            伤害系数: 2, 伤害范围: 100, 移动速度: 50, 冷却时间: 3000, 发射频率: 50, 发射次数: 50, 发射数量: 1, 皮肤地址: "resources/bullet/ZD_d_1.png"
        },
        10020: {
            typeID: 10003, 功能类型名: "BulletLaser", 发射样式: "z直线多发", 描述: "炮弹",
            伤害系数: 2, 伤害范围: 100, 移动速度: 400, 冷却时间: 1000, 发射频率: 150, 发射次数: 1, 发射数量: 1, 皮肤地址: "resources/bullet/ZD_d_1.png"
        }

    },
    skll: {
        10000: { typeID: 10000, }
    },
    sceneLevel: {
        level: 1,
        npc: {
            波次间隔: 3100,
            阶段1: {
                波次1: { npcID: [20000, 20001], 最小数量: 4, 最大数量: 10 },
                波次2: {},
                波次3: {},
                波次4: {},
                波次5: {},
            },
            阶段2: {},
            阶段3: {},
            阶段4: {},
            阶段5: {},
        }
    }
}